-- phpMyAdmin SQL Dump
-- version 4.6.6deb4
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: 18 яну 2022 в 08:03
-- Версия на сървъра: 5.7.26-29
-- PHP Version: 7.0.33-0+deb9u3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `niyazi`
--

-- --------------------------------------------------------

--
-- Структура на таблица `disciplines`
--

CREATE TABLE `disciplines` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `course` enum('1','2','3','4') COLLATE utf8mb4_unicode_ci NOT NULL,
  `semester` enum('1','2','3','4','5','6','7','8') COLLATE utf8mb4_unicode_ci NOT NULL,
  `teacher_id` int(10) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `disciplines`
--

INSERT INTO `disciplines` (`id`, `name`, `course`, `semester`, `teacher_id`, `created_at`, `updated_at`) VALUES
(6, 'Информационни управляващи системи', '3', '6', NULL, '2018-07-08 09:44:34', '2021-12-15 12:11:10'),
(8, 'ПИК - 1 част', '1', '1', 12, '2018-07-08 09:46:58', '2022-01-09 09:04:01'),
(9, 'ПИК - 2 част', '1', '2', 12, '2018-07-08 09:48:19', '2022-01-09 09:21:48'),
(11, 'Синтез и анализ на алгоритми', '2', '4', NULL, '2018-07-08 09:50:14', '2021-12-15 12:11:08'),
(12, 'Организация на компютъра', '3', '5', NULL, '2018-07-08 09:51:06', '2022-01-12 12:28:20'),
(13, 'Програмни езици', '3', '5', 12, '2018-07-08 09:51:58', '2021-12-15 12:10:28');

-- --------------------------------------------------------

--
-- Структура на таблица `disciplines_specialties`
--

CREATE TABLE `disciplines_specialties` (
  `id` int(11) NOT NULL,
  `discipline_id` int(10) UNSIGNED NOT NULL,
  `specialty_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `disciplines_specialties`
--

INSERT INTO `disciplines_specialties` (`id`, `discipline_id`, `specialty_id`) VALUES
(5, 11, 1),
(6, 6, 1),
(7, 12, 1),
(8, 13, 1),
(23, 9, 1),
(38, 8, 1),
(42, 8, 2);

-- --------------------------------------------------------

--
-- Структура на таблица `documents`
--

CREATE TABLE `documents` (
  `id` int(10) UNSIGNED NOT NULL,
  `created_by_id` int(10) UNSIGNED NOT NULL,
  `class_dir` varchar(50) NOT NULL,
  `instance_dir` int(10) UNSIGNED DEFAULT NULL,
  `hash` varchar(255) NOT NULL,
  `name` varchar(100) NOT NULL,
  `mime_type` varchar(50) NOT NULL,
  `downloadable_id` int(10) UNSIGNED DEFAULT NULL,
  `downloadable_type` varchar(100) NOT NULL,
  `document_type` enum('lecture','task','solution') NOT NULL,
  `created_at` timestamp NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Схема на данните от таблица `documents`
--

INSERT INTO `documents` (`id`, `created_by_id`, `class_dir`, `instance_dir`, `hash`, `name`, `mime_type`, `downloadable_id`, `downloadable_type`, `document_type`, `created_at`) VALUES
(1, 12, 'Task', 1, '_35a45e79e4b6fb238fac16cce140ca2c.png', 'edc-logo_clean.png', 'image/png', 1, 'App\\Models\\Task', 'task', '2021-12-16 09:30:45'),
(2, 12, 'Lecture', 2, '_8cbc28ab3bba45bf5e7d5a484aacd659.png', 'edc-logo_clean.png', 'image/png', 2, 'App\\Models\\Lecture', 'lecture', '2021-12-17 12:47:34'),
(3, 12, 'Lecture', 2, '_66a2bcfbcb1b133abbf4424c50a1043d.pdf', 'sample.pdf', 'application/pdf', 2, 'App\\Models\\Lecture', 'lecture', '2021-12-19 12:44:06'),
(5, 12, 'Lecture', 2, '_16926c67ebf9efbd4ce204227c67fe42.gif', 'giphy.gif', 'image/gif', 2, 'App\\Models\\Lecture', 'lecture', '2021-12-19 12:47:36'),
(6, 58, 'Task', 1, '_1dc3507905f27882e2ae7c1c41aface6.pdf', 'sample.pdf', 'application/pdf', 1, 'App\\Models\\Task', 'solution', '2021-12-27 12:54:30'),
(10, 58, 'Task', 2, '_8f097c63da21c653ba2d4e08389a845c.pdf', 'sample.pdf', 'application/pdf', 2, 'App\\Models\\Task', 'solution', '2021-12-27 13:48:03'),
(11, 58, 'Task', 3, '_1740a528ff428b3c2a0c90d27ae85b9b.pdf', 'sample.pdf', 'application/pdf', 3, 'App\\Models\\Task', 'solution', '2021-12-27 13:50:36'),
(12, 58, 'Task', 5, '_93efe8610989746e1c8c3faf231f2078.png', 'edc-logo_clean.png', 'image/png', 5, 'App\\Models\\Task', 'solution', '2021-12-27 13:51:50'),
(13, 12, 'Task', 6, '_777754e3db048bd99f3af3eed4116fe0.png', 'edc-logo_clean.png', 'image/png', 6, 'App\\Models\\Task', 'task', '2021-12-27 13:56:08'),
(14, 12, 'Task', 7, '_facc88252f03d05b85352f96fcdac341.png', 'edc-logo_clean.png', 'image/png', 7, 'App\\Models\\Task', 'task', '2021-12-27 13:57:29'),
(15, 12, 'Task', 8, '_316ea26fa3b94654f7883b77d503401a.png', 'edc-logo_clean.png', 'image/png', 8, 'App\\Models\\Task', 'task', '2021-12-28 10:47:12'),
(16, 58, 'Task', 8, '_480e28b22025face9f38aed551c4e0c0.pdf', 'sample.pdf', 'application/pdf', 8, 'App\\Models\\Task', 'solution', '2021-12-28 10:53:52');

-- --------------------------------------------------------

--
-- Структура на таблица `groups`
--

CREATE TABLE `groups` (
  `id` int(10) UNSIGNED NOT NULL,
  `specialty_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `course` enum('1','2','3','4') COLLATE utf8mb4_unicode_ci NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `created_at` timestamp NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `groups`
--

INSERT INTO `groups` (`id`, `specialty_id`, `name`, `course`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES
(1, 1, '41a', '1', '2021-11-01', '2025-11-01', '2018-07-08 10:02:15', '2022-01-09 09:22:52'),
(4, 1, '41b', '1', '2021-11-01', '2025-11-01', '2021-11-17 05:39:11', '2021-12-15 13:08:20'),
(10, 2, '41a', '2', '2020-01-01', '2023-12-01', '2021-12-25 06:39:59', '2021-12-29 06:13:40');

-- --------------------------------------------------------

--
-- Структура на таблица `lectures`
--

CREATE TABLE `lectures` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci,
  `discipline_id` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `lectures`
--

INSERT INTO `lectures` (`id`, `name`, `description`, `discipline_id`, `created_at`, `updated_at`) VALUES
(2, 'Lorem Ipsum', 'Lorem Ipsum е елементарен примерен текст, използван в печатарската и типографската индустрия. Lorem Ipsum е индустриален стандарт от около 1500 година.', 8, '2021-12-17 12:31:19', '2022-01-09 09:08:17'),
(4, 'Lorem Ipsum', 'Известен факт е, че читателя обръща внимание на съдържанието, което чете, а не на оформлението му. Свойството на Lorem Ipsum е, че до голяма степен има нормално разпределение на буквите и се чете по-лесно.', 8, '2021-12-19 11:50:50', '2021-12-19 12:00:17'),
(5, 'Lorem Ipsum', 'Противно на всеобщото вярване, Lorem Ipsum не е просто случаен текст. Неговите корени са в класическата Латинска литература от 45г.пр.Хр., което прави преди повече от 2000 години.', 8, '2021-12-19 11:51:37', '2021-12-19 12:00:23'),
(6, 'Lorem Ipsum', 'Съществуват много вариации на пасажа Lorem Ipsum, но повечето от тях са променени по един или друг начин чрез добавяне на смешни думи или разбъркване на думите, което не изглежда много достоверно. Ако искате да използвате пасаж от Lorem Ipsum, трябва да сте сигурни, че в него няма смущаващи или нецензурни думи.', 8, '2021-12-19 11:59:11', '2021-12-19 12:00:03'),
(7, 'Lorem Ipsum', 'Lorem Ipsum е елементарен примерен текст, използван в печатарската и типографската индустрия. Lorem Ipsum е индустриален стандарт от около 1500 година.', 9, '2021-12-27 10:16:09', '2021-12-27 10:17:54');

-- --------------------------------------------------------

--
-- Структура на таблица `messages`
--

CREATE TABLE `messages` (
  `id` int(10) UNSIGNED NOT NULL,
  `recipient_id` int(10) UNSIGNED NOT NULL,
  `sender_id` int(10) UNSIGNED NOT NULL,
  `message` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `subject` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `read_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NOT NULL,
  `deleted_by_recipient` tinyint(1) DEFAULT NULL,
  `deleted_by_sender` tinyint(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `messages`
--

INSERT INTO `messages` (`id`, `recipient_id`, `sender_id`, `message`, `subject`, `read_at`, `created_at`, `deleted_by_recipient`, `deleted_by_sender`) VALUES
(28, 10, 12, 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'What is Lorem Ipsum?', NULL, '2022-01-08 08:42:46', NULL, NULL),
(29, 12, 12, 'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout. The point of using Lorem Ipsum is that it has a more-or-less normal distribution of letters, as opposed to using \'Content here, content here\', making it look like readable English. Many desktop publishing packages and web page editors now use Lorem Ipsum as their default model text, and a search for \'lorem ipsum\' will uncover many web sites still in their infancy. Various versions have evolved over the years, sometimes by accident, sometimes on purpose (injected humour and the like).', 'Why do we use it?', '2022-01-09 08:43:31', '2022-01-08 08:43:26', NULL, NULL),
(31, 12, 58, 'There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don\'t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn\'t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.', 'Where can I get some?', NULL, '2022-01-08 08:45:33', NULL, NULL),
(40, 1, 58, 'Lorem ipsum dolor sit amet, consectetur adipiscing elit.\nMauris auctor ligula sit amet eros sodales maximus.\nCras a sem auctor, egestas libero in, finibus dolor.', 'Lorem Ipsum', NULL, '2022-01-08 08:53:02', NULL, NULL),
(42, 1, 12, 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.', 'What is Lorem Ipsum?', NULL, '2022-01-09 08:10:12', NULL, NULL);

-- --------------------------------------------------------

--
-- Структура на таблица `presences`
--

CREATE TABLE `presences` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` tinyint(1) NOT NULL,
  `date` date NOT NULL,
  `discipline_id` int(10) UNSIGNED NOT NULL,
  `teacher_id` int(10) UNSIGNED NOT NULL,
  `student_id` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `presences`
--

INSERT INTO `presences` (`id`, `name`, `date`, `discipline_id`, `teacher_id`, `student_id`, `created_at`) VALUES
(1, 1, '2021-12-01', 8, 12, 58, '2021-12-25 11:03:32'),
(2, 1, '2021-12-01', 8, 12, 52, '2021-12-25 11:03:32'),
(3, 1, '2021-12-01', 8, 12, 56, '2021-12-25 11:03:32'),
(4, 1, '2021-12-01', 8, 12, 43, '2021-12-25 11:03:32'),
(5, 1, '2021-12-01', 8, 12, 54, '2021-12-25 11:03:32'),
(6, 1, '2021-12-01', 8, 12, 45, '2021-12-25 11:03:33'),
(7, 1, '2021-12-01', 8, 12, 60, '2021-12-25 11:03:33'),
(8, 1, '2021-12-01', 8, 12, 63, '2021-12-25 11:03:33'),
(9, 1, '2021-12-01', 8, 12, 74, '2021-12-25 11:03:33'),
(10, 1, '2021-12-01', 8, 12, 34, '2021-12-25 11:03:33'),
(11, 0, '2021-12-01', 8, 12, 73, '2021-12-25 11:03:33'),
(12, 0, '2021-12-01', 8, 12, 33, '2021-12-25 11:03:33'),
(13, 0, '2021-12-01', 8, 12, 65, '2021-12-25 11:03:33'),
(14, 0, '2021-12-01', 8, 12, 68, '2021-12-25 11:03:33'),
(15, 0, '2021-12-01', 8, 12, 35, '2021-12-25 11:03:33'),
(16, 1, '2021-12-08', 8, 12, 58, '2021-12-25 11:04:01'),
(17, 1, '2021-12-08', 8, 12, 52, '2021-12-25 11:04:01'),
(18, 1, '2021-12-08', 8, 12, 56, '2021-12-25 11:04:01'),
(19, 1, '2021-12-08', 8, 12, 43, '2021-12-25 11:04:02'),
(20, 1, '2021-12-08', 8, 12, 54, '2021-12-25 11:04:02'),
(21, 1, '2021-12-08', 8, 12, 45, '2021-12-25 11:04:02'),
(22, 1, '2021-12-08', 8, 12, 60, '2021-12-25 11:04:02'),
(23, 1, '2021-12-08', 8, 12, 63, '2021-12-25 11:04:02'),
(24, 1, '2021-12-08', 8, 12, 74, '2021-12-25 11:04:02'),
(25, 1, '2021-12-08', 8, 12, 34, '2021-12-25 11:04:02'),
(26, 1, '2021-12-08', 8, 12, 73, '2021-12-25 11:04:02'),
(27, 1, '2021-12-08', 8, 12, 33, '2021-12-25 11:04:02'),
(28, 1, '2021-12-08', 8, 12, 65, '2021-12-25 11:04:02'),
(29, 1, '2021-12-08', 8, 12, 68, '2021-12-25 11:04:02'),
(30, 1, '2021-12-08', 8, 12, 35, '2021-12-25 11:04:03'),
(31, 0, '2021-12-15', 8, 12, 58, '2021-12-25 11:04:34'),
(32, 0, '2021-12-15', 8, 12, 52, '2021-12-25 11:04:35'),
(33, 0, '2021-12-15', 8, 12, 56, '2021-12-25 11:04:35'),
(34, 0, '2021-12-15', 8, 12, 43, '2021-12-25 11:04:35'),
(35, 0, '2021-12-15', 8, 12, 54, '2021-12-25 11:04:35'),
(36, 0, '2021-12-15', 8, 12, 45, '2021-12-25 11:04:35'),
(37, 0, '2021-12-15', 8, 12, 60, '2021-12-25 11:04:35'),
(38, 0, '2021-12-15', 8, 12, 63, '2021-12-25 11:04:35'),
(39, 0, '2021-12-15', 8, 12, 74, '2021-12-25 11:04:35'),
(40, 0, '2021-12-15', 8, 12, 34, '2021-12-25 11:04:35'),
(41, 0, '2021-12-15', 8, 12, 73, '2021-12-25 11:04:35'),
(42, 0, '2021-12-15', 8, 12, 33, '2021-12-25 11:04:36'),
(43, 0, '2021-12-15', 8, 12, 65, '2021-12-25 11:04:36'),
(44, 0, '2021-12-15', 8, 12, 68, '2021-12-25 11:04:36'),
(45, 0, '2021-12-15', 8, 12, 35, '2021-12-25 11:04:36'),
(46, 0, '2021-12-22', 8, 12, 58, '2021-12-25 11:04:49'),
(47, 0, '2021-12-22', 8, 12, 52, '2021-12-25 11:04:49'),
(48, 0, '2021-12-22', 8, 12, 56, '2021-12-25 11:04:50'),
(49, 0, '2021-12-22', 8, 12, 43, '2021-12-25 11:04:50'),
(50, 0, '2021-12-22', 8, 12, 54, '2021-12-25 11:04:50'),
(51, 1, '2021-12-22', 8, 12, 45, '2021-12-25 11:04:50'),
(52, 1, '2021-12-22', 8, 12, 60, '2021-12-25 11:04:50'),
(53, 1, '2021-12-22', 8, 12, 63, '2021-12-25 11:04:50'),
(54, 1, '2021-12-22', 8, 12, 74, '2021-12-25 11:04:50'),
(55, 1, '2021-12-22', 8, 12, 34, '2021-12-25 11:04:50'),
(56, 1, '2021-12-22', 8, 12, 73, '2021-12-25 11:04:50'),
(57, 1, '2021-12-22', 8, 12, 33, '2021-12-25 11:04:50'),
(58, 1, '2021-12-22', 8, 12, 65, '2021-12-25 11:04:50'),
(59, 1, '2021-12-22', 8, 12, 68, '2021-12-25 11:04:51'),
(60, 1, '2021-12-22', 8, 12, 35, '2021-12-25 11:04:51'),
(61, 1, '2021-12-25', 8, 12, 58, '2021-12-25 11:06:37'),
(62, 1, '2021-12-25', 8, 12, 52, '2021-12-25 11:06:37'),
(63, 1, '2021-12-25', 8, 12, 56, '2021-12-25 11:06:37'),
(64, 1, '2021-12-25', 8, 12, 43, '2021-12-25 11:06:37'),
(65, 1, '2021-12-25', 8, 12, 54, '2021-12-25 11:06:37'),
(66, 0, '2021-12-25', 8, 12, 45, '2021-12-25 11:06:37'),
(67, 0, '2021-12-25', 8, 12, 60, '2021-12-25 11:06:37'),
(68, 0, '2021-12-25', 8, 12, 63, '2021-12-25 11:06:37'),
(69, 0, '2021-12-25', 8, 12, 74, '2021-12-25 11:06:37'),
(70, 0, '2021-12-25', 8, 12, 34, '2021-12-25 11:06:38'),
(71, 1, '2021-12-25', 8, 12, 73, '2021-12-25 11:06:38'),
(72, 1, '2021-12-25', 8, 12, 33, '2021-12-25 11:06:38'),
(73, 1, '2021-12-25', 8, 12, 65, '2021-12-25 11:06:38'),
(74, 1, '2021-12-25', 8, 12, 68, '2021-12-25 11:06:38'),
(75, 1, '2021-12-25', 8, 12, 35, '2021-12-25 11:06:38'),
(76, 0, '2021-12-25', 8, 12, 69, '2021-12-25 11:07:03'),
(77, 0, '2021-12-25', 8, 12, 46, '2021-12-25 11:07:04'),
(78, 0, '2021-12-25', 8, 12, 49, '2021-12-25 11:07:04'),
(79, 0, '2021-12-25', 8, 12, 78, '2021-12-25 11:07:04'),
(80, 0, '2021-12-25', 8, 12, 72, '2021-12-25 11:07:04'),
(81, 0, '2021-12-25', 8, 12, 80, '2021-12-25 11:07:04'),
(82, 0, '2021-12-25', 8, 12, 48, '2021-12-25 11:07:04'),
(83, 0, '2021-12-25', 8, 12, 76, '2021-12-25 11:07:04'),
(84, 0, '2021-12-25', 8, 12, 41, '2021-12-25 11:07:04'),
(85, 0, '2021-12-25', 8, 12, 79, '2021-12-25 11:07:04'),
(86, 0, '2021-12-25', 8, 12, 75, '2021-12-25 11:07:04'),
(87, 0, '2021-12-25', 8, 12, 59, '2021-12-25 11:07:04'),
(88, 0, '2021-12-25', 8, 12, 40, '2021-12-25 11:07:05'),
(89, 0, '2021-12-25', 8, 12, 37, '2021-12-25 11:07:05'),
(90, 0, '2021-12-25', 8, 12, 44, '2021-12-25 11:07:05'),
(91, 0, '2021-12-24', 8, 12, 69, '2021-12-25 11:07:52'),
(92, 0, '2021-12-24', 8, 12, 46, '2021-12-25 11:07:52'),
(93, 0, '2021-12-24', 8, 12, 49, '2021-12-25 11:07:52'),
(94, 0, '2021-12-24', 8, 12, 78, '2021-12-25 11:07:52'),
(95, 0, '2021-12-24', 8, 12, 72, '2021-12-25 11:07:52'),
(96, 0, '2021-12-24', 8, 12, 80, '2021-12-25 11:07:52'),
(97, 0, '2021-12-24', 8, 12, 48, '2021-12-25 11:07:52'),
(98, 0, '2021-12-24', 8, 12, 76, '2021-12-25 11:07:52'),
(99, 0, '2021-12-24', 8, 12, 41, '2021-12-25 11:07:52'),
(100, 0, '2021-12-24', 8, 12, 79, '2021-12-25 11:07:52'),
(101, 0, '2021-12-24', 8, 12, 75, '2021-12-25 11:07:53'),
(102, 0, '2021-12-24', 8, 12, 59, '2021-12-25 11:07:53'),
(103, 0, '2021-12-24', 8, 12, 40, '2021-12-25 11:07:53'),
(104, 0, '2021-12-24', 8, 12, 37, '2021-12-25 11:07:53'),
(105, 0, '2021-12-24', 8, 12, 44, '2021-12-25 11:07:53'),
(106, 1, '2021-12-01', 8, 12, 69, '2021-12-25 11:08:49'),
(107, 0, '2021-12-01', 8, 12, 46, '2021-12-25 11:08:49'),
(108, 0, '2021-12-01', 8, 12, 49, '2021-12-25 11:08:49'),
(109, 0, '2021-12-01', 8, 12, 78, '2021-12-25 11:08:49'),
(110, 0, '2021-12-01', 8, 12, 72, '2021-12-25 11:08:49'),
(111, 0, '2021-12-01', 8, 12, 80, '2021-12-25 11:08:49'),
(112, 0, '2021-12-01', 8, 12, 48, '2021-12-25 11:08:49'),
(113, 0, '2021-12-01', 8, 12, 76, '2021-12-25 11:08:49'),
(114, 0, '2021-12-01', 8, 12, 41, '2021-12-25 11:08:49'),
(115, 0, '2021-12-01', 8, 12, 79, '2021-12-25 11:08:49'),
(116, 0, '2021-12-01', 8, 12, 75, '2021-12-25 11:08:50'),
(117, 0, '2021-12-01', 8, 12, 59, '2021-12-25 11:08:50'),
(118, 0, '2021-12-01', 8, 12, 40, '2021-12-25 11:08:50'),
(119, 0, '2021-12-01', 8, 12, 37, '2021-12-25 11:08:50'),
(120, 0, '2021-12-01', 8, 12, 44, '2021-12-25 11:08:50'),
(121, 1, '2021-12-08', 8, 12, 69, '2021-12-25 11:10:56'),
(122, 1, '2021-12-08', 8, 12, 46, '2021-12-25 11:10:56'),
(123, 1, '2021-12-08', 8, 12, 49, '2021-12-25 11:10:56'),
(124, 1, '2021-12-08', 8, 12, 78, '2021-12-25 11:10:56'),
(125, 1, '2021-12-08', 8, 12, 72, '2021-12-25 11:10:56'),
(126, 1, '2021-12-08', 8, 12, 80, '2021-12-25 11:10:56'),
(127, 1, '2021-12-08', 8, 12, 48, '2021-12-25 11:10:56'),
(128, 1, '2021-12-08', 8, 12, 76, '2021-12-25 11:10:57'),
(129, 1, '2021-12-08', 8, 12, 41, '2021-12-25 11:10:57'),
(130, 1, '2021-12-08', 8, 12, 79, '2021-12-25 11:10:57'),
(131, 1, '2021-12-08', 8, 12, 75, '2021-12-25 11:10:57'),
(132, 1, '2021-12-08', 8, 12, 59, '2021-12-25 11:10:57'),
(133, 1, '2021-12-08', 8, 12, 40, '2021-12-25 11:10:57'),
(134, 1, '2021-12-08', 8, 12, 37, '2021-12-25 11:10:57'),
(135, 1, '2021-12-08', 8, 12, 44, '2021-12-25 11:10:57'),
(136, 0, '2021-12-15', 8, 12, 69, '2021-12-25 11:11:25'),
(137, 0, '2021-12-15', 8, 12, 46, '2021-12-25 11:11:25'),
(138, 0, '2021-12-15', 8, 12, 49, '2021-12-25 11:11:25'),
(139, 0, '2021-12-15', 8, 12, 78, '2021-12-25 11:11:25'),
(140, 0, '2021-12-15', 8, 12, 72, '2021-12-25 11:11:25'),
(141, 0, '2021-12-15', 8, 12, 80, '2021-12-25 11:11:25'),
(142, 0, '2021-12-15', 8, 12, 48, '2021-12-25 11:11:25'),
(143, 0, '2021-12-15', 8, 12, 76, '2021-12-25 11:11:25'),
(144, 0, '2021-12-15', 8, 12, 41, '2021-12-25 11:11:25'),
(145, 0, '2021-12-15', 8, 12, 79, '2021-12-25 11:11:25'),
(146, 0, '2021-12-15', 8, 12, 75, '2021-12-25 11:11:25'),
(147, 0, '2021-12-15', 8, 12, 59, '2021-12-25 11:11:26'),
(148, 0, '2021-12-15', 8, 12, 40, '2021-12-25 11:11:26'),
(149, 0, '2021-12-15', 8, 12, 37, '2021-12-25 11:11:26'),
(150, 0, '2021-12-15', 8, 12, 44, '2021-12-25 11:11:26'),
(151, 1, '2021-12-22', 8, 12, 69, '2021-12-25 11:12:25'),
(152, 1, '2021-12-22', 8, 12, 46, '2021-12-25 11:12:25'),
(153, 1, '2021-12-22', 8, 12, 49, '2021-12-25 11:12:25'),
(154, 1, '2021-12-22', 8, 12, 78, '2021-12-25 11:12:25'),
(155, 1, '2021-12-22', 8, 12, 72, '2021-12-25 11:12:25'),
(156, 1, '2021-12-22', 8, 12, 80, '2021-12-25 11:12:25'),
(157, 1, '2021-12-22', 8, 12, 48, '2021-12-25 11:12:25'),
(158, 1, '2021-12-22', 8, 12, 76, '2021-12-25 11:12:26'),
(159, 1, '2021-12-22', 8, 12, 41, '2021-12-25 11:12:26'),
(160, 1, '2021-12-22', 8, 12, 79, '2021-12-25 11:12:26'),
(161, 1, '2021-12-22', 8, 12, 75, '2021-12-25 11:12:26'),
(162, 1, '2021-12-22', 8, 12, 59, '2021-12-25 11:12:26'),
(163, 1, '2021-12-22', 8, 12, 40, '2021-12-25 11:12:26'),
(164, 1, '2021-12-22', 8, 12, 37, '2021-12-25 11:12:26'),
(165, 1, '2021-12-22', 8, 12, 44, '2021-12-25 11:12:26'),
(166, 0, '2021-12-26', 8, 12, 58, '2021-12-25 11:14:18'),
(167, 0, '2021-12-26', 8, 12, 52, '2021-12-25 11:14:18'),
(168, 0, '2021-12-26', 8, 12, 56, '2021-12-25 11:14:18'),
(169, 0, '2021-12-26', 8, 12, 43, '2021-12-25 11:14:18'),
(170, 0, '2021-12-26', 8, 12, 54, '2021-12-25 11:14:18'),
(171, 0, '2021-12-26', 8, 12, 45, '2021-12-25 11:14:18'),
(172, 0, '2021-12-26', 8, 12, 60, '2021-12-25 11:14:18'),
(173, 0, '2021-12-26', 8, 12, 63, '2021-12-25 11:14:19'),
(174, 0, '2021-12-26', 8, 12, 74, '2021-12-25 11:14:19'),
(175, 0, '2021-12-26', 8, 12, 34, '2021-12-25 11:14:19'),
(176, 0, '2021-12-26', 8, 12, 73, '2021-12-25 11:14:19'),
(177, 0, '2021-12-26', 8, 12, 33, '2021-12-25 11:14:19'),
(178, 0, '2021-12-26', 8, 12, 65, '2021-12-25 11:14:19'),
(179, 0, '2021-12-26', 8, 12, 68, '2021-12-25 11:14:19'),
(180, 0, '2021-12-26', 8, 12, 35, '2021-12-25 11:14:19'),
(181, 1, '2021-12-26', 8, 12, 69, '2021-12-25 11:14:47'),
(182, 1, '2021-12-26', 8, 12, 46, '2021-12-25 11:14:47'),
(183, 1, '2021-12-26', 8, 12, 49, '2021-12-25 11:14:47'),
(184, 1, '2021-12-26', 8, 12, 78, '2021-12-25 11:14:48'),
(185, 1, '2021-12-26', 8, 12, 72, '2021-12-25 11:14:48'),
(186, 1, '2021-12-26', 8, 12, 80, '2021-12-25 11:14:48'),
(187, 1, '2021-12-26', 8, 12, 48, '2021-12-25 11:14:48'),
(188, 1, '2021-12-26', 8, 12, 76, '2021-12-25 11:14:48'),
(189, 1, '2021-12-26', 8, 12, 41, '2021-12-25 11:14:48'),
(190, 1, '2021-12-26', 8, 12, 79, '2021-12-25 11:14:48'),
(191, 1, '2021-12-26', 8, 12, 75, '2021-12-25 11:14:48'),
(192, 1, '2021-12-26', 8, 12, 59, '2021-12-25 11:14:48'),
(193, 1, '2021-12-26', 8, 12, 40, '2021-12-25 11:14:48'),
(194, 1, '2021-12-26', 8, 12, 37, '2021-12-25 11:14:48'),
(195, 1, '2021-12-26', 8, 12, 44, '2021-12-25 11:14:49'),
(196, 0, '2021-12-31', 8, 12, 58, '2021-12-25 11:58:18'),
(197, 0, '2021-12-31', 8, 12, 52, '2021-12-25 11:58:18'),
(198, 0, '2021-12-31', 8, 12, 56, '2021-12-25 11:58:18'),
(199, 0, '2021-12-31', 8, 12, 43, '2021-12-25 11:58:18'),
(200, 0, '2021-12-31', 8, 12, 54, '2021-12-25 11:58:18'),
(201, 0, '2021-12-31', 8, 12, 45, '2021-12-25 11:58:19'),
(202, 0, '2021-12-31', 8, 12, 60, '2021-12-25 11:58:19'),
(203, 0, '2021-12-31', 8, 12, 63, '2021-12-25 11:58:19'),
(204, 0, '2021-12-31', 8, 12, 74, '2021-12-25 11:58:19'),
(205, 0, '2021-12-31', 8, 12, 34, '2021-12-25 11:58:19'),
(206, 0, '2021-12-31', 8, 12, 73, '2021-12-25 11:58:19'),
(207, 0, '2021-12-31', 8, 12, 33, '2021-12-25 11:58:19'),
(208, 0, '2021-12-31', 8, 12, 65, '2021-12-25 11:58:19'),
(209, 0, '2021-12-31', 8, 12, 68, '2021-12-25 11:58:19'),
(210, 0, '2021-12-31', 8, 12, 35, '2021-12-25 11:58:19'),
(211, 1, '2022-01-01', 8, 12, 58, '2021-12-25 12:03:29'),
(212, 1, '2022-01-01', 8, 12, 52, '2021-12-25 12:03:29'),
(213, 0, '2022-01-01', 8, 12, 56, '2021-12-25 12:03:29'),
(214, 0, '2022-01-01', 8, 12, 43, '2021-12-25 12:03:29'),
(215, 0, '2022-01-01', 8, 12, 54, '2021-12-25 12:03:29'),
(216, 0, '2022-01-01', 8, 12, 45, '2021-12-25 12:03:29'),
(217, 0, '2022-01-01', 8, 12, 60, '2021-12-25 12:03:29'),
(218, 0, '2022-01-01', 8, 12, 63, '2021-12-25 12:03:30'),
(219, 0, '2022-01-01', 8, 12, 74, '2021-12-25 12:03:30'),
(220, 0, '2022-01-01', 8, 12, 34, '2021-12-25 12:03:30'),
(221, 0, '2022-01-01', 8, 12, 73, '2021-12-25 12:03:30'),
(222, 0, '2022-01-01', 8, 12, 33, '2021-12-25 12:03:30'),
(223, 0, '2022-01-01', 8, 12, 65, '2021-12-25 12:03:30'),
(224, 0, '2022-01-01', 8, 12, 68, '2021-12-25 12:03:30'),
(225, 0, '2022-01-01', 8, 12, 35, '2021-12-25 12:03:30'),
(226, 0, '2021-12-27', 8, 12, 58, '2021-12-27 06:54:21'),
(227, 1, '2021-12-27', 8, 12, 52, '2021-12-27 06:54:21'),
(228, 1, '2021-12-27', 8, 12, 56, '2021-12-27 06:54:21'),
(229, 1, '2021-12-27', 8, 12, 43, '2021-12-27 06:54:21'),
(230, 1, '2021-12-27', 8, 12, 54, '2021-12-27 06:54:21'),
(231, 1, '2021-12-27', 8, 12, 45, '2021-12-27 06:54:21'),
(232, 1, '2021-12-27', 8, 12, 60, '2021-12-27 06:54:21'),
(233, 1, '2021-12-27', 8, 12, 63, '2021-12-27 06:54:22'),
(234, 1, '2021-12-27', 8, 12, 74, '2021-12-27 06:54:22'),
(235, 1, '2021-12-27', 8, 12, 34, '2021-12-27 06:54:22'),
(236, 1, '2021-12-27', 8, 12, 73, '2021-12-27 06:54:22'),
(237, 1, '2021-12-27', 8, 12, 33, '2021-12-27 06:54:22'),
(238, 1, '2021-12-27', 8, 12, 65, '2021-12-27 06:54:22'),
(239, 1, '2021-12-27', 8, 12, 68, '2021-12-27 06:54:22'),
(240, 1, '2021-12-27', 8, 12, 35, '2021-12-27 06:54:22'),
(241, 1, '2021-12-27', 8, 12, 69, '2021-12-27 06:55:02'),
(242, 0, '2021-12-27', 8, 12, 46, '2021-12-27 06:55:02'),
(243, 0, '2021-12-27', 8, 12, 49, '2021-12-27 06:55:02'),
(244, 0, '2021-12-27', 8, 12, 78, '2021-12-27 06:55:03'),
(245, 0, '2021-12-27', 8, 12, 72, '2021-12-27 06:55:03'),
(246, 0, '2021-12-27', 8, 12, 80, '2021-12-27 06:55:03'),
(247, 0, '2021-12-27', 8, 12, 48, '2021-12-27 06:55:03'),
(248, 0, '2021-12-27', 8, 12, 76, '2021-12-27 06:55:03'),
(249, 0, '2021-12-27', 8, 12, 41, '2021-12-27 06:55:03'),
(250, 0, '2021-12-27', 8, 12, 79, '2021-12-27 06:55:03'),
(251, 0, '2021-12-27', 8, 12, 75, '2021-12-27 06:55:03'),
(252, 0, '2021-12-27', 8, 12, 59, '2021-12-27 06:55:03'),
(253, 0, '2021-12-27', 8, 12, 40, '2021-12-27 06:55:03'),
(254, 0, '2021-12-27', 8, 12, 37, '2021-12-27 06:55:03'),
(255, 0, '2021-12-27', 8, 12, 44, '2021-12-27 06:55:04'),
(256, 1, '2021-12-27', 9, 12, 58, '2021-12-27 10:18:11'),
(257, 1, '2021-12-27', 9, 12, 52, '2021-12-27 10:18:11'),
(258, 0, '2021-12-27', 9, 12, 56, '2021-12-27 10:18:11'),
(259, 0, '2021-12-27', 9, 12, 43, '2021-12-27 10:18:11'),
(260, 0, '2021-12-27', 9, 12, 54, '2021-12-27 10:18:11'),
(261, 0, '2021-12-27', 9, 12, 45, '2021-12-27 10:18:11'),
(262, 0, '2021-12-27', 9, 12, 60, '2021-12-27 10:18:12'),
(263, 0, '2021-12-27', 9, 12, 63, '2021-12-27 10:18:12'),
(264, 0, '2021-12-27', 9, 12, 74, '2021-12-27 10:18:12'),
(265, 0, '2021-12-27', 9, 12, 34, '2021-12-27 10:18:12'),
(266, 0, '2021-12-27', 9, 12, 73, '2021-12-27 10:18:12'),
(267, 0, '2021-12-27', 9, 12, 33, '2021-12-27 10:18:12'),
(268, 0, '2021-12-27', 9, 12, 65, '2021-12-27 10:18:12'),
(269, 0, '2021-12-27', 9, 12, 68, '2021-12-27 10:18:12'),
(270, 0, '2021-12-27', 9, 12, 35, '2021-12-27 10:18:12'),
(271, 1, '2022-01-05', 8, 12, 58, '2022-01-05 05:20:11'),
(272, 1, '2022-01-05', 8, 12, 52, '2022-01-05 05:20:11'),
(273, 1, '2022-01-05', 8, 12, 56, '2022-01-05 05:20:11'),
(274, 1, '2022-01-05', 8, 12, 43, '2022-01-05 05:20:11'),
(275, 1, '2022-01-05', 8, 12, 54, '2022-01-05 05:20:11'),
(276, 1, '2022-01-05', 8, 12, 45, '2022-01-05 05:20:11'),
(277, 1, '2022-01-05', 8, 12, 60, '2022-01-05 05:20:11'),
(278, 1, '2022-01-05', 8, 12, 63, '2022-01-05 05:20:11'),
(279, 1, '2022-01-05', 8, 12, 74, '2022-01-05 05:20:11'),
(280, 1, '2022-01-05', 8, 12, 34, '2022-01-05 05:20:11'),
(281, 1, '2022-01-05', 8, 12, 73, '2022-01-05 05:20:11'),
(282, 1, '2022-01-05', 8, 12, 33, '2022-01-05 05:20:12'),
(283, 1, '2022-01-05', 8, 12, 65, '2022-01-05 05:20:12'),
(284, 1, '2022-01-05', 8, 12, 68, '2022-01-05 05:20:12'),
(285, 1, '2022-01-05', 8, 12, 35, '2022-01-05 05:20:12'),
(286, 1, '2022-01-05', 9, 12, 69, '2022-01-05 05:21:36'),
(287, 0, '2022-01-05', 9, 12, 46, '2022-01-05 05:21:36'),
(288, 0, '2022-01-05', 9, 12, 49, '2022-01-05 05:21:36'),
(289, 0, '2022-01-05', 9, 12, 78, '2022-01-05 05:21:36'),
(290, 0, '2022-01-05', 9, 12, 72, '2022-01-05 05:21:36'),
(291, 0, '2022-01-05', 9, 12, 80, '2022-01-05 05:21:36'),
(292, 0, '2022-01-05', 9, 12, 48, '2022-01-05 05:21:37'),
(293, 0, '2022-01-05', 9, 12, 76, '2022-01-05 05:21:37'),
(294, 0, '2022-01-05', 9, 12, 41, '2022-01-05 05:21:37'),
(295, 0, '2022-01-05', 9, 12, 79, '2022-01-05 05:21:37'),
(296, 0, '2022-01-05', 9, 12, 75, '2022-01-05 05:21:37'),
(297, 0, '2022-01-05', 9, 12, 59, '2022-01-05 05:21:37'),
(298, 0, '2022-01-05', 9, 12, 40, '2022-01-05 05:21:37'),
(299, 0, '2022-01-05', 9, 12, 37, '2022-01-05 05:21:37'),
(300, 0, '2022-01-05', 9, 12, 44, '2022-01-05 05:21:37'),
(301, 1, '2022-01-05', 9, 12, 58, '2022-01-05 05:21:45'),
(302, 1, '2022-01-05', 9, 12, 52, '2022-01-05 05:21:45'),
(303, 0, '2022-01-05', 9, 12, 56, '2022-01-05 05:21:45'),
(304, 0, '2022-01-05', 9, 12, 43, '2022-01-05 05:21:45'),
(305, 0, '2022-01-05', 9, 12, 54, '2022-01-05 05:21:45'),
(306, 0, '2022-01-05', 9, 12, 45, '2022-01-05 05:21:46'),
(307, 0, '2022-01-05', 9, 12, 60, '2022-01-05 05:21:46'),
(308, 0, '2022-01-05', 9, 12, 63, '2022-01-05 05:21:46'),
(309, 0, '2022-01-05', 9, 12, 74, '2022-01-05 05:21:46'),
(310, 0, '2022-01-05', 9, 12, 34, '2022-01-05 05:21:46'),
(311, 0, '2022-01-05', 9, 12, 73, '2022-01-05 05:21:46'),
(312, 0, '2022-01-05', 9, 12, 33, '2022-01-05 05:21:46'),
(313, 0, '2022-01-05', 9, 12, 65, '2022-01-05 05:21:46'),
(314, 0, '2022-01-05', 9, 12, 68, '2022-01-05 05:21:46'),
(315, 0, '2022-01-05', 9, 12, 35, '2022-01-05 05:21:47'),
(316, 0, '2022-01-12', 8, 12, 58, '2022-01-12 10:14:44'),
(317, 0, '2022-01-12', 8, 12, 52, '2022-01-12 10:14:45'),
(318, 0, '2022-01-12', 8, 12, 56, '2022-01-12 10:14:45'),
(319, 0, '2022-01-12', 8, 12, 43, '2022-01-12 10:14:45'),
(320, 0, '2022-01-12', 8, 12, 54, '2022-01-12 10:14:46'),
(321, 0, '2022-01-12', 8, 12, 45, '2022-01-12 10:14:46'),
(322, 0, '2022-01-12', 8, 12, 60, '2022-01-12 10:14:46'),
(323, 0, '2022-01-12', 8, 12, 63, '2022-01-12 10:14:46'),
(324, 0, '2022-01-12', 8, 12, 74, '2022-01-12 10:14:46'),
(325, 0, '2022-01-12', 8, 12, 34, '2022-01-12 10:14:46'),
(326, 0, '2022-01-12', 8, 12, 73, '2022-01-12 10:14:47'),
(327, 0, '2022-01-12', 8, 12, 33, '2022-01-12 10:14:47'),
(328, 0, '2022-01-12', 8, 12, 65, '2022-01-12 10:14:47'),
(329, 0, '2022-01-12', 8, 12, 68, '2022-01-12 10:14:47'),
(330, 0, '2022-01-12', 8, 12, 35, '2022-01-12 10:14:47'),
(331, 0, '2022-01-12', 9, 12, 69, '2022-01-12 10:15:42'),
(332, 0, '2022-01-12', 9, 12, 46, '2022-01-12 10:15:42'),
(333, 0, '2022-01-12', 9, 12, 49, '2022-01-12 10:15:42'),
(334, 0, '2022-01-12', 9, 12, 78, '2022-01-12 10:15:42'),
(335, 0, '2022-01-12', 9, 12, 72, '2022-01-12 10:15:42'),
(336, 0, '2022-01-12', 9, 12, 80, '2022-01-12 10:15:43'),
(337, 0, '2022-01-12', 9, 12, 48, '2022-01-12 10:15:43'),
(338, 0, '2022-01-12', 9, 12, 76, '2022-01-12 10:15:43'),
(339, 0, '2022-01-12', 9, 12, 41, '2022-01-12 10:15:43'),
(340, 0, '2022-01-12', 9, 12, 79, '2022-01-12 10:15:43'),
(341, 0, '2022-01-12', 9, 12, 75, '2022-01-12 10:15:44'),
(342, 0, '2022-01-12', 9, 12, 59, '2022-01-12 10:15:44'),
(343, 0, '2022-01-12', 9, 12, 40, '2022-01-12 10:15:44'),
(344, 0, '2022-01-12', 9, 12, 37, '2022-01-12 10:15:44'),
(345, 0, '2022-01-12', 9, 12, 44, '2022-01-12 10:15:44');

-- --------------------------------------------------------

--
-- Структура на таблица `specialties`
--

CREATE TABLE `specialties` (
  `id` int(10) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `specialties`
--

INSERT INTO `specialties` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'Компютърни системи и технологии', '2020-11-30 05:22:24', '2022-01-09 09:10:28'),
(2, 'Електроника', '2021-11-14 09:29:33', '2021-11-14 09:29:33');

-- --------------------------------------------------------

--
-- Структура на таблица `tasks`
--

CREATE TABLE `tasks` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `assignment_id` int(10) DEFAULT NULL,
  `solution_id` int(10) DEFAULT NULL,
  `solution_upload_period` timestamp NULL DEFAULT NULL,
  `type` enum('course-work','home-work') COLLATE utf8mb4_unicode_ci NOT NULL,
  `discipline_id` int(10) UNSIGNED NOT NULL,
  `teacher_id` int(10) UNSIGNED NOT NULL,
  `student_id` int(10) UNSIGNED NOT NULL,
  `rating` float DEFAULT NULL,
  `created_at` timestamp NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Схема на данните от таблица `tasks`
--

INSERT INTO `tasks` (`id`, `name`, `assignment_id`, `solution_id`, `solution_upload_period`, `type`, `discipline_id`, `teacher_id`, `student_id`, `rating`, `created_at`) VALUES
(1, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', 1, 6, '2021-12-31 10:30:00', 'course-work', 8, 12, 58, 2, '2021-12-16 09:30:48'),
(2, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', NULL, 10, NULL, 'course-work', 8, 12, 58, 4.5, '2021-12-17 12:38:36'),
(3, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', NULL, 11, NULL, 'home-work', 8, 12, 58, 6, '2021-12-17 12:39:02'),
(5, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', NULL, 12, NULL, 'course-work', 9, 12, 58, 3.9, '2021-12-27 13:13:30'),
(6, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', 13, NULL, NULL, 'course-work', 8, 12, 52, NULL, '2021-12-27 13:56:11'),
(7, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old. ', 14, NULL, NULL, 'course-work', 9, 12, 52, NULL, '2021-12-27 13:57:31'),
(8, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old.', 15, 16, '2021-12-31 10:00:00', 'home-work', 9, 12, 58, 5.5, '2021-12-28 10:47:15'),
(9, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old.', NULL, NULL, NULL, 'home-work', 8, 12, 58, NULL, '2021-12-28 11:06:05'),
(10, 'Contrary to popular belief, Lorem Ipsum is not simply random text. It has roots in a piece of classical Latin literature from 45 BC, making it over 2000 years old.', NULL, NULL, NULL, 'home-work', 8, 12, 58, NULL, '2021-12-28 11:06:13');

-- --------------------------------------------------------

--
-- Структура на таблица `users`
--

CREATE TABLE `users` (
  `id` int(10) NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `fname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `sname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `login_type` enum('admin','teacher','student') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `active` tinyint(1) NOT NULL,
  `group_id` int(10) UNSIGNED DEFAULT NULL,
  `title` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `remember_token` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Схема на данните от таблица `users`
--

INSERT INTO `users` (`id`, `name`, `fname`, `sname`, `login_type`, `email`, `password`, `active`, `group_id`, `title`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Alexandrine', 'Emilie', 'Emile', 'admin', 'admin@abv.bg', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, '', '5gSdn7FeTMDSYhSn0McsokXwfsugbZ2HOksMLCAj2En8BHJfDqv8YI0LaXQY', '2021-11-25 07:52:30', '2022-01-12 12:06:55'),
(3, 'Drake', 'David', 'Elvera', 'admin', 'adelle06@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, NULL, 'iv2JZCrUQm', '2021-11-25 07:52:31', '2021-11-25 07:52:31'),
(6, 'Effie', 'Xavier', 'Lura', 'admin', 'joanny07@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, NULL, 'vtMBTMJtxm', '2021-11-25 07:52:31', '2021-11-25 07:52:31'),
(7, 'Aliya', 'Madison', 'Katelin', 'admin', 'jblick@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 0, NULL, NULL, 'CBcou6KRMB', '2021-11-25 07:52:31', '2021-11-25 07:54:42'),
(8, 'Esperanza', 'Herminio', 'Edwardo', 'admin', 'ernser.briana@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, NULL, 'm5iaPjTqTL', '2021-11-25 07:52:31', '2021-11-25 07:52:31'),
(9, 'Gerardo', 'Yvette', 'Beryl', 'admin', 'padberg.elinor@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, NULL, 'FXz9n36Mkx', '2021-11-25 07:52:31', '2021-11-25 07:52:31'),
(10, 'Aileen', 'Evangeline', 'Felton', 'admin', 'kihn.buddy@example.net', '$2y$10$ZtZQI1Lmr.DyXI0H9V6Pr.JYZHPGm4rvHyQ5jlcLk91cUXzzuPdpW', 1, NULL, NULL, '5SooVQKqHd', '2021-11-25 07:52:31', '2021-12-15 05:59:27'),
(11, 'Frieda', 'Minnie', 'Connie', 'teacher', 'nerdman@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'vkgz5gY2Uo', '2021-11-25 07:53:06', '2021-12-02 06:32:13'),
(12, 'Eulah', 'Reed', 'Claudia', 'teacher', 'teacher@abv.bg', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'проф.', 'RoYLFVPMNYzygm32xqgAtNtK4anXCYR5zIUZ372lHLHNKY8hyUa4AqM6bMRG', '2021-11-25 07:53:06', '2022-01-12 10:50:05'),
(13, 'Desiree', 'Victoria', 'Fanny', 'teacher', 'kianna.murazik@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'проф.', 'J0mTcZYiCp', '2021-11-25 07:53:06', '2021-11-25 07:53:06'),
(14, 'Rylee', 'Harmony', 'Clyde', 'teacher', 'trudie81@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'QWiGe1wp3R', '2021-11-25 07:53:06', '2021-11-25 07:53:06'),
(15, 'Brooks', 'Alfonso', 'Jazmyne', 'teacher', 'vkuvalis@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 0, NULL, 'гл. ас.', 'Xt7YqVVQRy', '2021-11-25 07:53:06', '2021-12-29 05:41:44'),
(16, 'Erwin', 'Fletcher', 'Orrin', 'teacher', 'gkoch@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'xCrVpWfWnNf0kIctpw5JJUeoYVr67Hfrm0zozSYZciBM636CtRlkOyVD2cQH', '2021-11-25 07:53:06', '2021-11-25 07:53:06'),
(17, 'Jeffry', 'Herminia', 'Reynold', 'teacher', 'jamison52@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'проф.', 'rlw313bHyR', '2021-11-25 07:53:06', '2021-11-25 07:53:06'),
(18, 'Calista', 'Franco', 'Chester', 'teacher', 'dibbert.damion@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'инж.', 'MLT6QuRubR', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(19, 'Joy', 'Kennedy', 'Keanu', 'teacher', 'duncan.wiegand@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'инж.', 't6oFbQGnkt', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(20, 'Annetta', 'Kaitlyn', 'Nina', 'teacher', 'felton.dibbert@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'доц. д-р', 'wxrDLWkBPF', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(21, 'Kimberly', 'Destiny', 'Herbert', 'teacher', 'keebler.leif@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'n5ZAHkkoDn', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(22, 'Liam', 'Helene', 'Irving', 'teacher', 'dawn.hahn@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'kCXozSReUK', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(23, 'Rudy', 'Lilian', 'Price', 'teacher', 'psatterfield@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'инж.', 'AxUDz5cqWZ', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(24, 'Andreanne', 'Felicia', 'Dominic', 'teacher', 'johnathon.reichel@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'доц. д-р', '2wr8uQG3uZ', '2021-11-25 07:53:07', '2021-12-10 10:39:28'),
(25, 'Polly', 'Joanne', 'Mariane', 'teacher', 'pstiedemann@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'проф.', 'FTdOramASh', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(26, 'Dejah', 'Everette', 'Lenora', 'teacher', 'okulas@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'маг. инж.', 'TjmtZTdchC', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(27, 'Nellie', 'Cruz', 'Myah', 'teacher', 'cassie.lowe@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'маг. инж.', '86tBvJFc9w', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(28, 'Thomas', 'Oliver', 'Justice', 'teacher', 'bstoltenberg@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'инж.', '84yqWldfK6', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(29, 'Ferne', 'Jamil', 'Eula', 'teacher', 'echamplin@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'гл. ас.', 'tQlQFri4u8', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(30, 'Michael', 'Asha', 'Marcelle', 'teacher', 'kayden98@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, NULL, 'проф.', 'nhgfoawwje', '2021-11-25 07:53:07', '2021-11-25 07:53:07'),
(33, 'Lincoln', 'Zoie', 'Glenda', 'student', 'bins.delphia@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'bCHAUgrRny', '2021-11-25 07:53:55', '2021-11-25 07:53:55'),
(34, 'Keith', 'Zaria', 'Dion', 'student', 'efrain.leffler@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'mdA6mo0mE4', '2021-11-25 07:53:55', '2021-11-25 07:53:55'),
(35, 'Robert', 'Susana', 'Eudora', 'student', 'leffler.margarette@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'UxPSOnQGhX', '2021-11-25 07:53:55', '2021-11-25 07:53:55'),
(37, 'Raquel', 'Maya', 'Elmira', 'student', 'renner.derick@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, '7YAd7DIpkc', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(40, 'Omari', 'Willie', 'Delia', 'student', 'iconnelly@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'ZWwny2s95m', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(41, 'Jerel', 'Celestino', 'Stephanie', 'student', 'dillan.kuhlman@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'WYfGpPznKP', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(43, 'Coby', 'Onie', 'Hayley', 'student', 'yleannon@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'wiCU4x9IWM', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(44, 'Rebeka', 'Marley', 'Marcia', 'student', 'kirsten43@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, '5jSxVOnsLq', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(45, 'Edd', 'Sanford', 'Jack', 'student', 'rwelch@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'LH0ijnsNx5', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(46, 'Evert', 'Mikel', 'Maxine', 'student', 'parker.edison@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'zcER7TPUd3', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(48, 'Jaden', 'Catharine', 'Elta', 'student', 'jeff.ernser@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'bukwTIrVEM', '2021-11-25 07:53:56', '2021-11-25 07:53:56'),
(49, 'Fred', 'Felton', 'Sim', 'student', 'kylee.schaden@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'ticIk7Soh1', '2021-11-25 07:53:57', '2021-11-25 07:53:57'),
(52, 'Brenda', 'Rowan', 'Letitia', 'student', 'beer.trycia@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 0, 1, NULL, 'jPo0CQAEeD', '2021-11-25 07:53:57', '2021-12-09 05:31:00'),
(54, 'Devon', 'Harrison', 'Marisol', 'student', 'matt72@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'ZLizBKtqD0', '2021-11-25 07:53:57', '2021-11-25 07:53:57'),
(56, 'Carlie', 'Abdul', 'Elsie', 'student', 'royce.hessel@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'PsLIOYIlfP', '2021-11-25 07:53:57', '2021-11-25 07:53:57'),
(58, 'Axel', 'Isom', 'Filomena', 'student', 'student@abv.bg', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'GDOnWX1qIxdUbP8DjmAop7pYXstoiNUQ4ioeg3UFW2FBzJAFKacD14eu6ZV2', '2021-11-25 07:53:57', '2021-12-27 08:26:02'),
(59, 'Mabelle', 'Renee', 'Devonte', 'student', 'sanford.marcel@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'xJDNZCEr0x', '2021-11-25 07:53:57', '2021-11-25 07:53:57'),
(60, 'Fern', 'Garnet', 'Roman', 'student', 'rschowalter@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'Aq0txTKvls', '2021-11-25 07:53:57', '2021-11-25 07:53:57'),
(63, 'Frederic', 'Matt', 'Carey', 'student', 'preston.witting@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 0, 1, NULL, '2x0svNTLPu', '2021-11-25 07:53:58', '2021-12-09 05:31:05'),
(65, 'Naomie', 'Fay', 'Evie', 'student', 'nicklaus34@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'htopDkMPd0', '2021-11-25 07:53:58', '2021-11-25 07:53:58'),
(68, 'Paula', 'Yasmeen', 'Abagail', 'student', 'jaren53@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'X9wvYR17qj', '2021-11-25 07:53:58', '2021-11-25 07:53:58'),
(69, 'Eudora', 'Stephen', 'Makayla', 'student', 'eveline.steuber@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'u0M3bw2MUh', '2021-11-25 07:53:58', '2021-11-25 07:53:58'),
(72, 'Harmon', 'Deborah', 'Ashlee', 'student', 'daniel.fae@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, '16CkcyiAw8', '2021-11-25 07:53:58', '2021-11-25 07:53:58'),
(73, 'Lauretta', 'Janet', 'Nia', 'student', 'orlando.kautzer@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, '9kGsntEkrx', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(74, 'Hollis', 'Edison', 'Adah', 'student', 'justina74@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 1, NULL, 'nACQAeS3wt', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(75, 'Kelsie', 'Blaze', 'Luella', 'student', 'berry.wintheiser@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'vP9uoi0qZd', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(76, 'Jennie', 'Claudine', 'Vincent', 'student', 'nash00@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'cWzxLTf1Zj', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(78, 'Greta', 'Aiden', 'Kaia', 'student', 'rice.freeman@example.org', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'vTqN4elwig', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(79, 'Jett', 'Irving', 'Gertrude', 'student', 'laila.hettinger@example.net', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, '3aXEGyVGvi', '2021-11-25 07:53:59', '2021-11-25 07:53:59'),
(80, 'Hudson', 'Blaze', 'Cameron', 'student', 'jesse.lockman@example.com', '$2y$10$92IXUNpkjO0rOQ5byMi.Ye4oKoEa3Ro9llC/.og/at2.uheWG/igi', 1, 4, NULL, 'oFrLMDTAve', '2021-11-25 07:53:59', '2021-11-25 07:53:59');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `disciplines`
--
ALTER TABLE `disciplines`
  ADD PRIMARY KEY (`id`),
  ADD KEY `disciplines_teacher_id_index` (`teacher_id`);

--
-- Indexes for table `disciplines_specialties`
--
ALTER TABLE `disciplines_specialties`
  ADD PRIMARY KEY (`id`),
  ADD KEY `discipline_id` (`discipline_id`),
  ADD KEY `specialty_id` (`specialty_id`);

--
-- Indexes for table `documents`
--
ALTER TABLE `documents`
  ADD PRIMARY KEY (`id`),
  ADD KEY `downloadable_id` (`downloadable_id`),
  ADD KEY `instance_dir` (`instance_dir`),
  ADD KEY `created_by_id` (`created_by_id`);

--
-- Indexes for table `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`),
  ADD KEY `specialty_id` (`specialty_id`);

--
-- Indexes for table `lectures`
--
ALTER TABLE `lectures`
  ADD PRIMARY KEY (`id`),
  ADD KEY `lectures_discipline_id_index` (`discipline_id`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `messages_recipient_id_index` (`recipient_id`),
  ADD KEY `messages_sender_id_index` (`sender_id`);

--
-- Indexes for table `presences`
--
ALTER TABLE `presences`
  ADD PRIMARY KEY (`id`),
  ADD KEY `presences_discipline_id_index` (`discipline_id`),
  ADD KEY `presences_teacher_id_index` (`teacher_id`),
  ADD KEY `presences_student_id_index` (`student_id`);

--
-- Indexes for table `specialties`
--
ALTER TABLE `specialties`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tasks`
--
ALTER TABLE `tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `tasks_discipline_id_index` (`discipline_id`),
  ADD KEY `tasks_teacher_id_index` (`teacher_id`),
  ADD KEY `tasks_student_id_index` (`student_id`),
  ADD KEY `assignment_id` (`assignment_id`,`solution_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `group_id` (`group_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `disciplines`
--
ALTER TABLE `disciplines`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
--
-- AUTO_INCREMENT for table `disciplines_specialties`
--
ALTER TABLE `disciplines_specialties`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;
--
-- AUTO_INCREMENT for table `documents`
--
ALTER TABLE `documents`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
--
-- AUTO_INCREMENT for table `groups`
--
ALTER TABLE `groups`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT for table `lectures`
--
ALTER TABLE `lectures`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
--
-- AUTO_INCREMENT for table `presences`
--
ALTER TABLE `presences`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=346;
--
-- AUTO_INCREMENT for table `specialties`
--
ALTER TABLE `specialties`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `tasks`
--
ALTER TABLE `tasks`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;
--
-- Ограничения за дъмпнати таблици
--

--
-- Ограничения за таблица `disciplines_specialties`
--
ALTER TABLE `disciplines_specialties`
  ADD CONSTRAINT `disciplines_specialties_ibfk_1` FOREIGN KEY (`discipline_id`) REFERENCES `disciplines` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
